package main

import "fmt"

func main() {

	// تعریف یک متغیر عددی
	var a int

	// چاپ پیام برای دریافت ورودی از کاربر
	fmt.Println("عدد را وارد کنید")

	// دریافت ورودی و ذخیره آن در متغیر a
	fmt.Scanln(&a)

	// بررسی مقدار وارد شده با استفاده از شرط‌ها
	if a < 10 {
		// اگر مقدار کمتر از 10 باشد
		fmt.Println("بزرگتر از 10")
	} else if a <= 90 {
		// اگر مقدار بین 10 و 90 باشد (شامل 90)
		fmt.Println("good")
	} else {
		// اگر مقدار بزرگتر از 90 باشد
		fmt.Println("کوچکتر از  10")
	}

	// استفاده از عملگرهای منطقی && (AND) و || (OR) برای ترکیب شرط‌ها (در صورت نیاز)
	// مثال:
	// if a > 10 && a < 20 {
	//     fmt.Println("عدد بین 10 و 20 است")
	// }
	// if a < 5 || a > 50 {
	//     fmt.Println("عدد خارج از بازه 5 تا 50 است")
	// }
}
