package main

// وارد کردن پکیج "encoding/json" برای کار با JSON
import "encoding/json"

// تعریف یک ثابت عمومی به نام api که مقدار آن "ali" است
const api = "ali"

// تعریف گروهی از ثابت‌ها با مقادیر عددی
const (
	a  = 0   // مقدار ثابت a برابر 0
	b  = 1   // مقدار ثابت b برابر 1
	hi = 100 // مقدار ثابت hi برابر 100
)

// تعریف یک نوع داده جدید به نام mm که نوع پایه آن int است
type mm int

// تعریف یک ساختار (struct) به نام kk با دو فیلد
type kk struct {
	id   int // فیلد id از نوع int برای ذخیره شناسه
	name mm  // فیلد name از نوع mm (تعریف‌شده قبلی) برای ذخیره نام یا مقدار عددی خاص
}

func main() {

	// ایجاد یک نمونه از ساختار kk با مقداردهی اولیه به فیلدهای id و name
	p := kk{id: 1, name: 12}

	// تبدیل ساختار p به داده‌های JSON با استفاده از تابع json.Marshal
	// این تابع مقدار بازگشتی اول، داده‌های JSON و مقدار دوم خطا است که اینجا نادیده گرفته شده (_)
	pp, _ := json.Marshal(p)

	// چاپ داده‌های JSON تولیدشده به صورت رشته
	print(string(pp))

	// چاپ مقدار ثابت api که مقدار آن "ali" است
	print(api)

	// چاپ مقدار ثابت b که مقدار آن 1 است
	print(b)
}
