package main

import "fmt"

// تعریف یک نوع داده ساختار (struct) به نام a که شامل دو فیلد است
// b از نوع string و c از نوع int
type a struct {
	b string
	c int
}

func main() {
	// ایجاد یک نمونه از ساختار a با استفاده از مقداردهی مستقیم
	// مقدار فیلد b برابر "ali" و فیلد c برابر 12 می‌شود
	ali := a{b: "ali", c: 12}

	// استفاده از دستور new برای ایجاد یک اشاره‌گر به ساختار a
	// new(a) یک اشاره‌گر به ساختار a ایجاد می‌کند که مقادیر آن صفر است
	// سپس مقادیر فیلدهای آن به ترتیب b و c مقداردهی می‌شوند
	m := new(a)
	m.b = "ali"
	m.c = 123

	// ایجاد یک اشاره‌گر به ساختار a با مقداردهی مستقیم
	// این مشابه ساختار ali است اما به صورت اشاره‌گر ایجاد می‌شود
	ai := &a{b: "ali", c: 12}

	// چاپ مقادیر سه نمونه ساخته شده
	// ali به صورت ساختاری (value type)، m به صورت اشاره‌گر (pointer) و ai هم به صورت اشاره‌گر است
	// اگرچه همه این‌ها مقادیر مشابهی دارند، نحوه ذخیره‌سازی آن‌ها متفاوت است
	fmt.Println(ali, m, ai)
}
