package main

import "fmt"

// تعریف ساختار a که شامل دو فیلد است:
// fild b از نوع string و fild c از نوع int
type a struct {
	b string
	c int
}

func main() {
	// ایجاد یک متغیر از نوع a و مقداردهی به فیلدهای آن
	// مقدار فیلد b برابر "ali" و مقدار فیلد c برابر 12 است
	var u a = a{b: "ali", c: 12}

	// فراخوانی تابع p با پارامتر u
	// تابع p مقدار فیلد c از ساختار a را در 12 ضرب کرده و نتیجه آن را باز می‌گرداند
	o1 := p(u)

	// چاپ نتیجه بازگشتی از تابع p
	// در اینجا مقدار حاصل از ضرب 12 در مقدار c یعنی 12 * 12 که برابر 144 است چاپ می‌شود
	fmt.Println(o1)
}

// تابع p که یک پارامتر از نوع a می‌گیرد و مقدار int را باز می‌گرداند
// این تابع مقدار فیلد c از ساختار n را در 12 ضرب می‌کند و باز می‌گرداند
func p(n a) int {
	// ضرب مقدار c از ساختار n در 12 و بازگشت نتیجه
	// در اینجا، اگر n.c برابر با 12 باشد، خروجی 12 * 12 = 144 خواهد بود
	return n.c * 12
}
