package main

import "fmt"

func main() {

	// تعریف یک آرایه صحیح با اندازه 2 که مقادیر اولیه ندارد
	var arr [2]int

	// تعریف یک آرایه صحیح با اندازه 2 و مقداردهی اولیه
	var arr2 [2]int = [2]int{1, 2}

	// تعریف و مقداردهی یک آرایه صحیح با استفاده از نوع استنتاج شده
	arr3 := [2]int{1, 2}

	// تعریف آرایه با استفاده از اندازه متغیر (محاسبه خودکار طول آرایه)
	arr4 := [...]int{1, 2}

	// مقداردهی دستی یک عنصر از آرایه
	arr[1] = 2

	// چاپ آرایه‌ها و طول آرایه arr4
	fmt.Print(arr, arr2, arr3, len(arr4))

	// تعریف آرایه رشته‌ای و مقداردهی اولیه
	name := [4]string{"ali0", "ali1", "ali2", "ali3"}

	// پیمایش آرایه name با استفاده از حلقه for
	for i := 0; i < len(name); i++ {
		if name[i] == "ali0" {
			// اگر مقدار عنصر برابر با "ali0" باشد، ایندکس آن چاپ می‌شود
			fmt.Print("| > ", i)
		}
	}

	// کپی کردن آرایه arr به aarr (کپی مستقل)
	aarr := arr

	// ایجاد اشاره‌گر به آرایه arr
	aarr1 := &arr

	// چاپ آرایه کپی‌شده و اشاره‌گر به آرایه اصلی
	fmt.Print(aarr, aarr1)

}
