package main

import "fmt"

func main() {

	// تعریف یک اسلایس از اعداد صحیح با مقداردهی اولیه
	arr := []int{11, 2, 3, 4, 5, 6, 7, 8, 9}

	// ایجاد یک اسلایس که از ایندکس 1 تا انتهای arr را شامل می‌شود
	arr1 := arr[1:]

	// ایجاد یک اسلایس که فقط عنصر اول arr را شامل می‌شود
	arr2 := arr[:1]

	// تغییر مقدار ایندکس 2 آرایه اصلی، که بر روی اسلایس‌های مرتبط نیز تأثیر می‌گذارد
	arr[2] = 101

	// افزودن مقدار 12 به اسلایس arr1 با استفاده از append
	arr1 = append(arr1, 12)

	// چاپ محتوای arr2 و ظرفیت arr1
	fmt.Println(arr2, cap(arr1))
}
