package main

import "fmt"

func main() {

	// چاپ پیغام "Hello World!" به کنسول
	fmt.Println("Hello World!")

	// ایجاد یک نقشه (map) با نوع int به عنوان کلید و string به عنوان مقدار
	// این نقشه از قبل آماده شده و به آن داده‌های کلید و مقدار اضافه خواهیم کرد
	a := make(map[int]string)
	// ایجاد یک نقشه (map) مشابه با روش دیگر
	// در اینجا از ساختار {} استفاده شده که مشابه روش make است
	b := map[int]string{}

	// افزودن داده به نقشه a: کلید 1 و مقدار "ali"
	// توجه: باید از عدد 1 به جای "1" (رشته) به عنوان کلید استفاده کنیم
	a[1] = "ali"
	// افزودن داده به نقشه b: کلید 1 و مقدار "ali"
	// مشابه نقشه a، باید از عدد 1 به عنوان کلید استفاده کنیم
	b[1] = "ali"

	// چاپ مقادیر نقشه‌ها a و b
	// از %v برای چاپ مقادیر نقشه به صورت عمومی استفاده شده است
	// به طور مثال در اینجا نقشه‌ها به صورت دیکشنری (Map) چاپ خواهند شد
	fmt.Printf("a: %v, b: %v\n", a, b)

	// حذف یک عنصر از نقشه a با استفاده از کلید 1
	// دستور delete برای حذف عنصر با کلید مشخص از نقشه استفاده می‌شود
	delete(a, 1)

	// دریافت مقدار از نقشه a با استفاده از کلید 1
	// اگر کلید 1 وجود نداشته باشد، مقدار پیش‌فرض برای رشته‌ها "" (رشته خالی) خواهد بود
	o := a[1]

	// چاپ مقدار متغیر o که می‌تواند رشته خالی باشد زیرا کلید 1 از نقشه a حذف شده است
	// اگر کلید 1 حذف شده باشد، مقدار o برابر با رشته خالی خواهد بود
	fmt.Println("Value of o:", o)
}
